tap "benbjohnson/litestream"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "localsend/localsend"
tap "lukasknuth/tap", "git@github.com:LukasKnuth/homebrew-tap.git"
tap "nikitabobko/tap"
tap "siderolabs/tap"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# TIFF library and utilities
brew "libtiff"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Vector graphics library with cross-device output support
brew "cairo"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Text processing system for reStructuredText
brew "docutils"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# XSL-FO print formatter for making PDF or PS documents
brew "fop"
# Manage Procfile-based applications
brew "foreman"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# File format designed to store large amounts of data
brew "hdf5"
# Cartographic Projections Library
brew "proj"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Adds spatial SQL capabilities to SQLite
brew "libspatialite"
# Package for scientific computing with Python
brew "numpy"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Framework for scientific data networking
brew "libdap"
# C XSLT library for GNOME
brew "libxslt"
# LTeX+ Language Server: maintained fork of LTeX Language Server
brew "ltex-ls-plus"
# Personal Knowledge Management System for the LSP
brew "markdown-oxide"
# Language Server Protocol for Markdown
brew "marksman"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Tool for visualizing differences between two pdf files
brew "pdf-diff"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Rename your files using your favorite text editor
brew "pipe-rename"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Generic machine emulator and virtualizer
brew "qemu"
# File browser
brew "ranger"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Markup-based typesetting system
brew "typst"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Find security issues in GitHub Actions setups
brew "zizmor"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Streaming replication for SQLite
brew "benbjohnson/litestream/litestream"
# Terraform Language Server
brew "hashicorp/tap/terraform-ls"
# Vault
brew "hashicorp/tap/vault"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "siderolabs/tap/talosctl"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Professional graphic design software
cask "affinity-designer"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Backup and restore SD cards, USB drives, external HDD, etc
cask "applepi-baker"
# Multi-track audio editor and recorder
cask "audacity"
# Display management tool
cask "betterdisplay"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Allows switching between application windows
cask "contexts"
# API documentation browser and code snippet manager
cask "dash@6"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# System-wide audio equaliser
cask "eqmac"
# Web browser
cask "firefox"
cask "font-jetbrains-mono"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Disk partitioning tool
cask "gdisk"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Vector graphics editor
cask "inkscape"
# App to manage software development and track bugs
cask "linear-linear"
# Code notebooks for Elixir developers
cask "livebook"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Screen and video recording software
cask "loom"
# Tag editor for digital music
cask "meta"
# Tool to create text-based art
cask "monodraw"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Android file transfer
cask "openmtp"
# Archive manager for data compression and backups
cask "rar"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Truly removes mouse acceleration in Apple system
cask "steelseries-exactmouse-tool"
# Cross-platform music player and music collection organizer and iPod support
cask "strawberry"
# Text editor for code, markup and prose
cask "sublime-text"
# Real time file synchronisation software
cask "syncthing-app"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Network protocol analyzer
cask "wireshark-app"
vscode "aaron-bond.better-comments"
vscode "bbenoist.nix"
vscode "be5invis.toml"
vscode "bradlc.vscode-tailwindcss"
vscode "castwide.solargraph"
vscode "editorconfig.editorconfig"
vscode "firsttris.vscode-jest-runner"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "hridoy.rails-snippets"
vscode "iampeterbanjo.elixirlinter"
vscode "jacobpfeifer.pfeifer-hurl"
vscode "jakebecker.elixir-ls"
vscode "jebbs.plantuml"
vscode "mrorz.language-gettext"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vsliveshare.vsliveshare"
vscode "octref.vetur"
vscode "phoenixframework.phoenix"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-yaml"
vscode "ryu1kn.annotator"
vscode "shopify.ruby-lsp"
vscode "skellock.just"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "typespec.typespec-vscode"
vscode "vscodevim.vim"
