tap "benbjohnson/litestream"
tap "hashicorp/tap"
tap "localsend/localsend"
tap "nikitabobko/tap"
tap "siderolabs/tap"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Automatic configure script builder
brew "autoconf"
# Deduplicating archiver with compression and authenticated encryption
brew "borgbackup"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Manage Procfile-based applications
brew "foreman"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Fast linters runner for Go
brew "golangci-lint"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# LTeX+ Language Server: maintained fork of LTeX Language Server
brew "ltex-ls-plus"
# Personal Knowledge Management System for the LSP
brew "markdown-oxide"
# Language Server Protocol for Markdown
brew "marksman"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Rename your files using your favorite text editor
brew "pipe-rename"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Generic machine emulator and virtualizer
brew "qemu"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Intuitive find & replace CLI
brew "sd"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Services for Typst
brew "tinymist"
# Markup-based typesetting system
brew "typst"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Find security issues in GitHub Actions setups
brew "zizmor"
# Streaming replication for SQLite
brew "benbjohnson/litestream/litestream"
# Terraform Language Server
brew "hashicorp/tap/terraform-ls"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "siderolabs/tap/talosctl"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Professional graphic design software
cask "affinity-designer"
# Backup and restore SD cards, USB drives, external HDD, etc
cask "applepi-baker"
# Multi-track audio editor and recorder
cask "audacity"
# API documentation browser and code snippet manager
cask "dash@6"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# System-wide audio equaliser
cask "eqmac"
# Web browser
cask "firefox"
cask "font-jetbrains-mono"
# Disk partitioning tool
cask "gdisk"
# Web browser
cask "google-chrome"
# Code notebooks for Elixir developers
cask "livebook"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Tag editor for digital music
cask "meta"
# Tool to create text-based art
cask "monodraw"
# Open-source software for live streaming and screen recording
cask "obs"
# Android file transfer
cask "openmtp"
# Archive manager for data compression and backups
cask "rar"
# Music streaming service
cask "spotify"
# Real time file synchronisation software
cask "syncthing-app"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Network protocol analyzer
cask "wireshark-app"
