aaron-bond.better-comments
bbenoist.nix
be5invis.toml
bradlc.vscode-tailwindcss
castwide.solargraph
editorconfig.editorconfig
firsttris.vscode-jest-runner
golang.go
hashicorp.terraform
hridoy.rails-snippets
iampeterbanjo.elixirlinter
jacobpfeifer.pfeifer-hurl
jakebecker.elixir-ls
jebbs.plantuml
mrorz.language-gettext
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vsliveshare.vsliveshare
octref.vetur
phoenixframework.phoenix
pomdtr.excalidraw-editor
redhat.vscode-yaml
ryu1kn.annotator
shopify.ruby-lsp
skellock.just
sleistner.vscode-fileutils
streetsidesoftware.code-spell-checker
typespec.typespec-vscode
vscodevim.vim
